<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Informacion</title>
<style type="text/css">
<!--
body,td,th {
	color: #FFFFFF;
}
body {
	background-color: #000000;
}
.Estilo2 {font-family: "Times New Roman", Times, serif}
.Estilo3 {
	color: #FFFF00;
	font-size: 24px;
}
-->
</style></head>

<body>
<div align="center">
  <p class="Estilo3">Informaci&oacute;n </p>
</div>
<blockquote>
  <p align="justify"><span class="Estilo2"> COW es un lenguaje de programaci&oacute;n orientado a bovinos. Ya sabemos que las vacas s&oacute;lo entienden la palabra &laquo;moo&raquo; (o traducido al espa&ntilde;ol, &laquo;muu&raquo;), por lo que todas las palabras claves del lenguaje son variaciones en may&uacute;scula o min&uacute;scula de la misma. Esto nos facilita bastante las cosas a la hora de documentar los programas, ya que todo lo que no sea &laquo;moo&raquo; (en cualquiera de sus formas alternativas) se tomar&aacute; por un comentario. B&aacute;sicamente, COW es un lenguaje imperativo en el que tenemos acceso a una memoria (en principio ilimitada) indexada por posici&oacute;n. En todo momento hay un puntero interno que nos indica cu&aacute;l es bloque de memoria actual, y disponemos de instrucciones para desplazar este puntero hacia adelante (moO) o hacia atr&aacute;s (mOo). Por supuesto, podemos modificar el contenido de la direcci&oacute;n apuntada, decrement&aacute;ndolo en 1 (MOo), increment&aacute;ndolo en 1 (MoO), o fij&aacute;ndolo a 0 (OOO). Hay tambi&eacute;n un registro interno del/al que podemos copiar el valor de un bloque de memoria mediante&nbsp;MMM. La entrada/salida se realiza mediante&nbsp;oom&nbsp;(para leer un valor y almacenarlo en el bloque de memoria actual) y&nbsp;OOM&nbsp;(para imprimir el valor del bloque de memoria actual).</span></p>
  <p align="justify">Lo m&aacute;s interesante de COW son las instrucciones que hacen referencia al control del flujo de ejecuci&oacute;n. Tenemos as&iacute; a&nbsp;MOO&nbsp;y&nbsp;moo&nbsp;que son muy similares (pero no id&eacute;nticas) a&nbsp;while&nbsp;y&nbsp;endwhile&nbsp;respectivamente (usando el valor del bloque actual de memoria como condici&oacute;n de control: 0 es FALSE, y diferente de 0 es TRUE).&nbsp;Moo&nbsp;es una lectura/escritura condicionada al valor del bloque de memoria actual (lectura si es 0, escritura en otro caso). Finalmente,&nbsp;mOO&nbsp;ejecuta el contenido del bloque de memoria actual como si fuera una instrucci&oacute;n (hay un c&oacute;digo num&eacute;rico para cada una). Es importante tener en cuenta que al igual que ocurr&iacute;a con Homespring, en COW se retira la carga de una sintaxis estricta de los hombros del programador, no situ&aacute;ndola en ning&uacute;n lugar en particular. As&iacute;, no tiene por qu&eacute; haber un&nbsp;moo&nbsp;para todo&nbsp;MOO&nbsp;(ni viceversa). M&aacute;s a&uacute;n, la disponibilidad de&nbsp;mOO&nbsp;proporciona la flexibilidad de LISP a la hora de manipular programas como datos, abriendo la puerta por ejemplo a la definici&oacute;n din&aacute;mica de bucles.</p>
</blockquote>
<p align="center"><img src="descarga.jpg" width="258" height="193" vspace="50" /></p>
</body>

</html>
